## Joining tables
In  pandas two tables can joins mainly 4 types:
1. inner joins `pd.merge(df1,df2,on = 'city', how = 'inner')   # how = 'inner' default value`
2. outer joins `pd.merge(df1,df2,on = 'city', how = 'outer')`
3. left joins `pd.merge(df1,df2,on = 'city', how = 'left')`
4. right joins `pd.merge(df1,df2,on = 'city', how = 'right')`

In [1]:
import pandas as pd
df1 = pd.DataFrame({'city' : ['Delhi','Mumbai','Lucknow'],'Tempreture': [38,32,35]})
df1

      city  Tempreture
0    Delhi          38
1   Mumbai          32
2  Lucknow          35

In [2]:
df2 = pd.DataFrame({'city' : ['Mumbai','Delhi','Lucknow'],'Humdity': [22,48,55]})
df2

      city  Humdity
0   Mumbai       22
1    Delhi       48
2  Lucknow       55

In [3]:
pd.merge(df1,df2)

      city  Tempreture  Humdity
0    Delhi          38       48
1   Mumbai          32       22
2  Lucknow          35       55

In [4]:
pd.merge(df1,df2, on = 'city', how = 'inner')

      city  Tempreture  Humdity
0    Delhi          38       48
1   Mumbai          32       22
2  Lucknow          35       55

In [5]:
df1 = pd.DataFrame({'city' : ['Delhi','Mumbai','Lucknow','Deharadun'],'Tempreture': [38,32,35,25]})
df1

        city  Tempreture
0      Delhi          38
1     Mumbai          32
2    Lucknow          35
3  Deharadun          25

In [6]:
df2 = pd.DataFrame({'city' : ['Mumbai','Delhi','chennai','Lucknow'],'Humdity': [22,48,65,55]})
df2

      city  Humdity
0   Mumbai       22
1    Delhi       48
2  chennai       65
3  Lucknow       55

#### inner joins

In [8]:
# pd.merge(df1,df2,on= 'city')
pd.merge(df1,df2,on= 'city',how = 'inner')

      city  Tempreture  Humdity
0    Delhi          38       48
1   Mumbai          32       22
2  Lucknow          35       55

#### outer joins

In [10]:
pd.merge(df1,df2,on = 'city', how = 'outer')

        city  Tempreture  Humdity
0      Delhi        38.0     48.0
1     Mumbai        32.0     22.0
2    Lucknow        35.0     55.0
3  Deharadun        25.0      NaN
4    chennai         NaN     65.0

#### left joins

In [11]:
pd.merge(df1,df2, on = 'city',how = 'left')

        city  Tempreture  Humdity
0      Delhi          38     48.0
1     Mumbai          32     22.0
2    Lucknow          35     55.0
3  Deharadun          25      NaN

#### right joins

In [13]:
pd.merge(df1,df2, on = 'city',how = 'right')

      city  Tempreture  Humdity
0   Mumbai        32.0       22
1    Delhi        38.0       48
2  chennai         NaN       65
3  Lucknow        35.0       55